Pandas Data Structures
Series DataFrame

# Series

In [2]:
import pandas as pd

In [3]:
s = pd.Series([11,22,33,44,55,66,77])

In [6]:
s #pandas series object  
#labels/index and values

0    11
1    22
2    33
3    44
4    55
5    66
6    77
dtype: int64

getting a single series values

In [7]:
s[4]

55

In [11]:
#s[3,0,5]  error
s[[3,0,5]]  #list bana ke

3    44
0    11
5    66
dtype: int64

In [15]:
#updating single value
s[3] = 88

In [16]:
s[3]

88

In [17]:
#updating single value
s[2,0,4] = [00, 99,111]

In [18]:
s

0     99
1     22
2      0
3     88
4    111
5     66
6     77
dtype: int64

In [19]:
#deleting a value
del s[4]

In [20]:
s

0    99
1    22
2     0
3    88
5    66
6    77
dtype: int64

In [23]:
#deleting multiple values not possible
del a[[1,3]]

NameError: name 'a' is not defined

In [26]:
s[1234] = 90876
s

0          99
1          22
2           0
3          88
5          66
6          77
1234    90876
dtype: int64

In [28]:
s[111,456,23] = [2,4,0] 
#multiple insert Not possible

KeyError: "None of [Int64Index([111, 456, 23], dtype='int64')] are in the [index]"

In [30]:
s1 = pd.Series([1,2,3,4],index = ["apple", "orange", "banana", "grapes"])
#indexing

In [32]:
s1

apple     1
orange    2
banana    3
grapes    4
dtype: int64

In [33]:
aDic = {"name": "Ali", "class": "AI", "Time": "5-9"}

In [34]:
aDic

{'name': 'Ali', 'class': 'AI', 'Time': '5-9'}

In [36]:
s2 = pd.Series(aDic)
s2

name     Ali
class     AI
Time     5-9
dtype: object

In [49]:
s3 = pd.Series(s1, index = ["mango", "orange", "banana", "grapes"])
#mango ki value s1 ke pas nhe to NaN (missing value)

In [50]:
s3

mango     NaN
orange    2.0
banana    3.0
grapes    4.0
dtype: float64

In [42]:
s3["mango"] = 5
s3

mango     5.0
orange    2.0
banana    3.0
grapes    4.0
dtype: float64

In [56]:
s3.nullvalues

AttributeError: 'Series' object has no attribute 'nullvalues'

In [43]:
s3.values

array([5., 2., 3., 4.])

In [44]:
s3.index

Index(['mango', 'orange', 'banana', 'grapes'], dtype='object')

In [45]:
s3>200

mango     False
orange    False
banana    False
grapes    False
dtype: bool

In [47]:
s3[s3>3] #values ke saat

mango     5.0
grapes    4.0
dtype: float64

In [53]:
s4 = pd.Series(s1.values, index = [111,222,333,444])

In [54]:
s4

111    1
222    2
333    3
444    4
dtype: int64

In [55]:
s3+s4

111      NaN
222      NaN
333      NaN
444      NaN
banana   NaN
grapes   NaN
mango    NaN
orange   NaN
dtype: float64

# DataFrames

In [58]:
df = pd.DataFrame([123,456,789])
df

     0
0  123
1  456
2  789

In [62]:
df1 = pd.DataFrame(["red","green","blue"], index = ['v1', 'v2','v3'],columns=["colors"])
df1

   colors
v1    red
v2  green
v3   blue

# Creating a DataFrame from a Dictionary

In [147]:
score = {"AI for Eo": [77,79,64,85,50,95,96],
        "Python1"   : [85,37,81,93,90,97,93],
        "Python2"   : [66,68,74,76,90,47,83]}

In [148]:
score

{'AI for Eo': [77, 79, 64, 85, 50, 95, 96],
 'Python1': [85, 37, 81, 93, 90, 97, 93],
 'Python2': [66, 68, 74, 76, 90, 47, 83]}

In [149]:
df3 = pd.DataFrame(score,index=["ali","ahmed","faisal","zia","raza","taha","waqar"])

In [150]:
df3

        AI for Eo  Python1  Python2
ali            77       85       66
ahmed          79       37       68
faisal         64       81       74
zia            85       93       76
raza           50       90       90
taha           95       97       47
waqar          96       93       83

In [151]:
#data = pd.read_csv("FileName.csv")

In [152]:
df3.head(2)
#default 5 sarting data dekhaiyega value de kar or dekh sakte

       AI for Eo  Python1  Python2
ali           77       85       66
ahmed         79       37       68

In [153]:
df3.tail()
#last 5 values default

        AI for Eo  Python1  Python2
faisal         64       81       74
zia            85       93       76
raza           50       90       90
taha           95       97       47
waqar          96       93       83

In [154]:
df3.info()  #all info

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, ali to waqar
Data columns (total 3 columns):
AI for Eo    7 non-null int64
Python1      7 non-null int64
Python2      7 non-null int64
dtypes: int64(3)
memory usage: 224.0+ bytes

In [155]:
df3.describe() #min,max,mean,25%,50%,70%

       AI for Eo    Python1    Python2
count   7.000000   7.000000   7.000000
mean   78.000000  82.285714  72.000000
std    16.552945  20.677800  13.796135
min    50.000000  37.000000  47.000000
25%    70.500000  83.000000  67.000000
50%    79.000000  90.000000  74.000000
75%    90.000000  93.000000  79.500000
max    96.000000  97.000000  90.000000

In [156]:
df3.Python1

ali       85
ahmed     37
faisal    81
zia       93
raza      90
taha      97
waqar     93
Name: Python1, dtype: int64

In [157]:
df3['AI for Eo']  #name has space

ali       77
ahmed     79
faisal    64
zia       85
raza      50
taha      95
waqar     96
Name: AI for Eo, dtype: int64

In [158]:
df3[['AI for Eo','Python1']]

        AI for Eo  Python1
ali            77       85
ahmed          79       37
faisal         64       81
zia            85       93
raza           50       90
taha           95       97
waqar          96       93

In [159]:
df3.loc['taha'] #location = loc

AI for Eo    95
Python1      97
Python2      47
Name: taha, dtype: int64

In [160]:
df3.loc[['taha','raza']]

      AI for Eo  Python1  Python2
taha         95       97       47
raza         50       90       90

In [161]:
df3.loc[['taha','raza']]['Python1']

taha    97
raza    90
Name: Python1, dtype: int64

In [162]:
df3["Total"] = df3['AI for Eo'] + df3['Python1'] + df3['Python2']

In [163]:
df3

        AI for Eo  Python1  Python2  Total
ali            77       85       66    228
ahmed          79       37       68    184
faisal         64       81       74    219
zia            85       93       76    254
raza           50       90       90    230
taha           95       97       47    239
waqar          96       93       83    272

In [164]:
df3["Avg"] = ((df3.Total*100)/300)

In [165]:
df3

        AI for Eo  Python1  Python2  Total        Avg
ali            77       85       66    228  76.000000
ahmed          79       37       68    184  61.333333
faisal         64       81       74    219  73.000000
zia            85       93       76    254  84.666667
raza           50       90       90    230  76.666667
taha           95       97       47    239  79.666667
waqar          96       93       83    272  90.666667

In [166]:
df3["status"] = df3["Total"]<200
df3

        AI for Eo  Python1  Python2  Total        Avg  status
ali            77       85       66    228  76.000000   False
ahmed          79       37       68    184  61.333333    True
faisal         64       81       74    219  73.000000   False
zia            85       93       76    254  84.666667   False
raza           50       90       90    230  76.666667   False
taha           95       97       47    239  79.666667   False
waqar          96       93       83    272  90.666667   False

In [167]:
import numpy as np
df3["status"] = np.where(df3['Total']>200,"Pass","Fail")

In [168]:
df3

        AI for Eo  Python1  Python2  Total        Avg status
ali            77       85       66    228  76.000000   Pass
ahmed          79       37       68    184  61.333333   Fail
faisal         64       81       74    219  73.000000   Pass
zia            85       93       76    254  84.666667   Pass
raza           50       90       90    230  76.666667   Pass
taha           95       97       47    239  79.666667   Pass
waqar          96       93       83    272  90.666667   Pass

In [169]:
df3["status"] = ["Pass" if marks>250 else "Fail" for marks in df3['Total']]
df3

        AI for Eo  Python1  Python2  Total        Avg status
ali            77       85       66    228  76.000000   Fail
ahmed          79       37       68    184  61.333333   Fail
faisal         64       81       74    219  73.000000   Fail
zia            85       93       76    254  84.666667   Pass
raza           50       90       90    230  76.666667   Fail
taha           95       97       47    239  79.666667   Fail
waqar          96       93       83    272  90.666667   Pass

In [170]:
df3["grade"] = ["A" if marks>=280 elif marks>=270 "B" elif marks>=240 "C" else "Fail" for marks in df3['Total']]
df3

SyntaxError: invalid syntax (<ipython-input-170-490ef7a46f4a>, line 1)

In [171]:
df3["RevisedStatus"] = np.where((df3['AI for Eo']>=50) & (df3['Python1']>=50) & (df3['Python2']>=50), "Pass", "Fail")

In [172]:
df3

        AI for Eo  Python1  Python2  Total        Avg status RevisedStatus
ali            77       85       66    228  76.000000   Fail          Pass
ahmed          79       37       68    184  61.333333   Fail          Fail
faisal         64       81       74    219  73.000000   Fail          Pass
zia            85       93       76    254  84.666667   Pass          Pass
raza           50       90       90    230  76.666667   Fail          Pass
taha           95       97       47    239  79.666667   Fail          Fail
waqar          96       93       83    272  90.666667   Pass          Pass

In [173]:
df3["NewStatus"] = ["Pass" if (ai>=50) & (p1>=50) & (p2>=50) else "Fail" for ai,p1,p2 in zip(df3['AI for Eo'], df3['Python1'], df3['Python2'])]

In [174]:
df3

,AI for Eo,Python1,Python2,Total,Avg,status,RevisedStatus,NewStatus
ali,77,85,66,228,76.000000,Fail,Pass,Pass
ahmed,79,37,68,184,61.333333,Fail,Fail,Fail
faisal,64,81,74,219,73.000000,Fail,Pass,Pass
zia,85,93,76,254,84.666667,Pass,Pass,Pass
raza,50,90,90,230,76.666667,Fail,Pass,Pass
taha,95,97,47,239,79.666667,Fail,Fail,Fail
waqar,96,93,83,272,90.666667,Pass,Pass,Pass

In [176]:
x = [1,2,3]
y = ['a','b','c']
z = zip(a,b)

In [177]:
for x,y in z:
    print(x,y)

1 a
2 b
3 c